Revit 2027 API
ParameterTypeId.CarbonMaterialParamProviderId Property
 "Carbon Provider ID"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CarbonMaterialParamProviderId { get; }
Public Shared ReadOnly Property CarbonMaterialParamProviderId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CarbonMaterialParamProviderId {
	ForgeTypeId^ get ();
}
static member CarbonMaterialParamProviderId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace